-- -------------------------------------------------------------------------------------------------
-- program name:   test-data.sql
-- function:       test date 插入数据 用于测试
-- author:         wangc
-- release date:   24 May, 2016
-- -------------------------------------------------------------------------------------------------

-- step 1 ------------------------------------------------------------------------------------------
-- create table supplier 供应商表
-- -------------------------------------------------------------------------------------------------
insert into tsupplier(
	supplier_name,
	is_checked,
	create_time,
	modify_time) values(
		"巨人网络",
		1,
		sysdate(),
		sysdate());
-- step 2 ------------------------------------------------------------------------------------------
-- create table employee 员工表
-- -------------------------------------------------------------------------------------------------
insert into temployee(
	employee_name,
	role_id,
	supplier_id,
	employee_mobile,
	password,
	create_time,
	modify_time) values(
		"李巨人",
		1,
		1,
		"18667666278",
		'21218cca77804d2ba1922c33e0151105',
		sysdate(),
		sysdate());
